from IPython.display import display, HTML

def Question(question_) : 
  display(HTML(question_))

question_0010 = '''
코이스터디 0010번 문제
'''
img_1101 = "https://github.com/GoHakNeung/python/blob/main/img_1101.JPG?raw=true"
answer_0010 = [{'input': [['-459']], 'output': ['-459']}, {'input': [['-33']], 'output': ['-33']}, {'input': [['-166']], 'output': ['-166']}, {'input': [['0']], 'output': ['0']}, {'input': [['-331']], 'output': ['-331']}, {'input': [['224']], 'output': ['224']}, {'input': [['-22']], 'output': ['-22']}, {'input': [['-142']], 'output': ['-142']}, {'input': [['462']], 'output': ['462']}, {'input': [['-36']], 'output': ['-36']}]

question_0045 = '''
코이스터디 0045번 문제
'''
img_1101 = "https://github.com/GoHakNeung/python/blob/main/img_1101.JPG?raw=true"
answer_0045 = [{'input': [['-1097418296 -536788336 -1614671456']],
  'output': ['1046089208', '348696402.7']},
 {'input': [['-2017111359 -1341886504 -1767689384']],
  'output': ['-831719951', '-277239983.7']},
 {'input': [['-736361184 -1912315084 -1973452448']],
  'output': ['-327161420', '-109053806.7']},
 {'input': [['1945291274 1003538914 1849691912']],
  'output': ['503554804', '167851601.3']},
 {'input': [['50050544 -1252327262 1448128470']],
  'output': ['245851752', '81950584.0']},
 {'input': [['1769378800 1150295040 1290438016']],
  'output': ['-84855440', '-28285146.7']},
 {'input': [['-1878450920 130510584 1337882840']],
  'output': ['-410057496', '-136685832.0']},
 {'input': [['-1271545344 -1426125120 -1713326756']],
  'output': ['-116029924', '-38676641.3']},
 {'input': [['-2147483648 -2147483648 -2147483647']],
  'output': ['-6442450943', '-2147483647.7']},
 {'input': [['2147483647 2147483647 2147483647']],
  'output': ['6442450941', '2147483647.0']}]




test_set = [
#입력,변수,출력_수와 연산산
    {'test_file' : '0010', 'answer' : answer_0010,'question' : question_0010, 'img' : img_1101},
    {'test_file' : '0045', 'answer' : answer_0045,'question' : question_0045, 'img' : img_1101},
]
